# frozen_string_literal: true

# specify a directory to install
cask_args appdir: '/Applications'

brew 'git'
brew 'hub'
brew 'rbenv'
brew 'tree'
brew 'q'
cask 'gitup'

cask 'firefox'
cask 'google-chrome'

cask 'obsidian'
cask '1password'
cask 'authy'
cask 'calibre'
cask 'coconutbattery'
cask 'daisydisk'
cask 'dropbox'
cask 'flux'
cask 'itsycal'
cask 'michaelvillar-timer'
cask 'monitorcontrol'
cask 'spectacle'
# cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
brew 'ffmpeg'
cask 'whatsapp'
cask 'chatgpt'

brew 'mas'
# mas 'Be Focused Pro', id: 961632517
# mas 'Unsplash', id: 1284863847
# mas 'Open In Webmail', id: 1451552749

cask 'discord'
cask 'slack'

cask 'alfred@4'
# cask 'dash'
cask 'iterm2'
cask 'visual-studio-code'

cask 'spotify'
cask 'steam'

# cask 'font-inconsolata'
# cask 'font-fira-code'
# cask 'font-hack'
# cask 'font-m-plus'
# cask 'font-ubuntu'
# cask 'font-hermit'
# cask 'font-victor-mono'
# cask 'aerial'
