# frozen_string_literal: true

# specify a directory to install
cask_args appdir: '/Applications'

brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'hub'
brew 'rbenv'
brew 'tree'
brew 'q'
cask 'gitup'
cask 'licecap'

cask 'firefox'
cask 'google-chrome'

cask '1password'
cask 'authy'
cask 'calibre'
cask 'coconutbattery'
cask 'daisydisk'
cask 'dropbox'
cask 'flux'
cask 'gpg-suite'
cask 'grammarly'
cask 'itsycal'
cask 'michaelvillar-timer'
cask 'rescuetime'
cask 'spectacle'
cask 'the-unarchiver'
cask 'transmission'
cask 'typora'
cask 'vlc'
cask 'tweetbot'
brew 'ffmpeg'

brew 'mas'
mas 'Shush', id: 496437906
mas 'Keynote', id: 409183694
mas 'Be Focused Pro', id: 961632517
mas 'Unsplash', id: 1284863847
mas 'Open In Webmail', id: 1451552749

cask 'discord'
cask 'slack'

cask 'alfred'
cask 'dash'
cask 'iterm2'
cask 'postman'
cask 'sublime-text'

cask 'spotify'
cask 'steam'

tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-m-plus'
cask 'font-ubuntu'
cask 'font-hermit'
cask 'font-victor-mono'
cask 'aerial'
